<?php

error_reporting(E_ERROR);

use ZLabs\Frontend\MustacheSingleton;

require_once $_SERVER['DOCUMENT_ROOT'] . '/../../vendor/autoload.php';

$mustache = MustacheSingleton::getInstance();

$pageConfig = [
    'meta' => [
        'title' => 'new-project.ru: Главная',
    ],
    'title' => 'new-project.ru: Главная',
    'isMainPage' => true,
    'mainClass' => 'index',
    'inlineCss' => collect([
        'bundle-common',
        'bundle-homepage',
    ]),
    'inlineJs' => collect([]),
    'deferredCss' => collect([]),
    'deferredJs' => collect([
        'bundle-common',
        'bundle-homepage',
    ]),
    'asyncJs' => collect([]),
];

require_once($_SERVER['DOCUMENT_ROOT'] . '/include/header.php');
?>

<?php
$sort = [
    'title' => 'Сортировать:',
    'links' => [
        ['link' => 'По популярности', 'href' => '#'],
        ['link' => 'По цене', 'href' => '#'],
        ['link' => 'По рейтингу', 'href' => '#'],
        ['link' => 'По отзывам', 'href' => '#'],
        ['link' => 'По размеру скидки', 'href' => '#'],
        ['link' => 'По новизне', 'href' => '#'],
    ]
]
?>

<?php
$questions = [
    'title' => 'Остались вопросы? Отвечаем',
    'items' => [
        [
            'text' => 'В чём заключается условия гарантии и возврата запасных частей?',
            'hidden' => 'Гарантия: на все запасные части предоставляется гарантия производителя. Гарантия не распространяется на повреждения, вызванные неправильной установкой, эксплуатацией или естественным износом.'

        ],
        [
            'text' => 'Что входит в ТО по гарантии?',
            'hidden' => '',
        ],
        [
            'text' => 'Какой средний срок доставки запчасти?',
            'hidden' => '',
        ],
        [
            'text' => 'Что входит в ТО по гарантии?',
            'hidden' => '',
        ],
        [
            'text' => 'Какой средний срок доставки запчасти?',
            'hidden' => '',
        ],
        [
            'text' => 'В чём заключается условия гарантии и возврата запасных частей?',
            'hidden' => '',
        ],
        [
            'text' => 'Что входит в ТО по гарантии?',
            'hidden' => '',
        ],
    ]
]
?>

<?php
$collapsing = [
    'title' => 'Кондитерские ингредиенты',
    'hidden' => 'Сегодня, когда ожидания потребителей стали выше, чем когда-либо, пищевым предприятиям особенно важно иметь надежного партнера, заинтересованного
                    в их успехе. Ведь чтобы удовлетворять требованиям потребителей завтра, об этом нужно позаботиться уже сегодня.
                    И в этом поможем Вам мы, коллектив Центра Пищевых Технологий. <br><br>

                    Пекари, кондитеры, а также домашние мастера, которые хотят стать профессионалами в этом деле, найдут у нас огромный выбор современных, профессиональных и натуральных ингредиентов, большое количество рецептур, высококачественный пекарский и кондитерский инвентарь, упаковочные материалы, а также технологическую поддержку.',
    'buttonText' => 'Читать полностью',
]
?>

<?php
$menu = [
    'items' => [
        [
            'title' => 'Каталог',
            'links' => [
                ['link' => 'Лазерные станки'],
                ['link' => 'Фрезерные станки'],
                ['link' => 'Токарные станки'],
                ['link' => 'Гидроабразивные станки'],
                ['link' => 'Плоттеры'],
                ['link' => 'Плазморезы'],
                ['link' => 'Комплектующие'],
            ]
        ],
        [
            'title' => 'Клиентам',
            'links' => [
                ['link' => 'Гарантия и сервис'],
                ['link' => 'Вопросы и ответы'],
                ['link' => 'Возврат товара'],
                ['link' => 'Предпродажная подготовка'],
                ['link' => 'Новости'],
                ['link' => 'Отзывы покупателей'],
                ['link' => 'Карта сайта'],
                ['link' => 'Статьи'],
            ]
        ],
        [
            'title' => 'Юр. лицам',
            'links' => [
                ['link' => 'Партнерство'],
                ['link' => 'Сертификаты качества'],
                ['link' => 'Наши реквизиты'],
                ['link' => 'Гарантии'],
            ]
        ],
    ]
]
?>

<?php
$confectionery = [
    'title' => 'Популярные категории',
    'button' => 'Все категории',
    'items' => [
        [
            'item-logo' => '',
            'text' => 'Кондитерские ингредиенты',
            'links' => [
                ['link' => 'Ароматизаторы'],
                ['link' => 'Бумага съедобная'],
                ['link' => 'Вспомогательные продукты'],
                ['link' => 'Гели'],
                ['link' => 'Глазури'],
                ['link' => 'Готовые выпечные полуфабрикаты'],
                ['link' => 'Десертные пасты'],
                ['link' => 'Желирующие агенты'],
            ]
        ],
        [
            'item-logo' => '',
            'text' => 'Для декора и оформления',
            'links' => [
                ['link' => 'Вафельный декор'],
                ['link' => 'Вафельные визитки'],
                ['link' => 'Вафельные пластины'],
                ['link' => 'Вафельные украшения'],
                ['link' => 'Декор из глазури'],
                ['link' => 'Драже'],
                ['link' => 'Зефир, маршмеллоу'],
                ['link' => 'Злаки в шоколаде'],
            ]
        ],
        [
            'item-logo' => '',
            'text' => 'Хлебопекарные ингредиенты',
            'links' => [
                ['link' => 'Для декора'],
                ['link' => 'Для придания глянца'],
                ['link' => 'Для продления свежести'],
                ['link' => 'Для смазки форм и противней'],
                ['link' => 'Дополнительные продукты для хлеба'],
                ['link' => 'Дрожи'],
                ['link' => 'Закваски'],
                ['link' => 'Смеси для бездрожжевых изделий'],
            ]
        ],
        [
            'item-logo' => '',
            'text' => 'Для производства мороженого',
            'links' => [
                ['link' => 'Вафельные стаканчики'],
                ['link' => 'Смеси для мороженного'],
                ['link' => 'Топпинги'],
            ]
        ],
        [
            'item-logo' => '',
            'text' => 'Для мясных производств и общепита',
            'links' => [
                ['link' => 'Бульоны сухие'],
                ['link' => 'Бумага съедобная'],
                ['link' => 'Вспомогательные продукты'],
                ['link' => 'Гели'],
                ['link' => 'Глазури'],
                ['link' => 'Готовые выпечные полуфабрикаты'],
                ['link' => 'Десертные пасты'],
                ['link' => 'Желирующие агенты'],
            ]
        ],
        [
            'item-logo' => '',
            'text' => 'Упаковка',
            'links' => [
                ['link' => 'Вафельный декор'],
                ['link' => 'Вафельные визитки'],
                ['link' => 'Вафельные пластины'],
                ['link' => 'Вафельные украшения'],
                ['link' => 'Декор из глазури'],
                ['link' => 'Драже'],
                ['link' => 'Зефир, маршмеллоу'],
                ['link' => 'Злаки в шоколаде'],
            ]
        ],
        [
            'item-logo' => '',
            'text' => 'Технологическое оборудование',
            'links' => [
                ['link' => 'Для декора'],
                ['link' => 'Для придания глянца'],
                ['link' => 'Для продления свежести'],
                ['link' => 'Для смазки форм и противней'],
                ['link' => 'Дополнительные продукты для хлеба'],
                ['link' => 'Дрожи'],
                ['link' => 'Закваски'],
                ['link' => 'Смеси для бездрожжевых изделий'],
            ]
        ],
        [
            'item-logo' => '',
            'text' => 'Инвентарь',
            'links' => [
                ['link' => 'Венчики'],
                ['link' => 'Вырубки'],
                ['link' => 'Вырубки для печенья'],
                ['link' => 'Вырубки для пончиков'],
                ['link' => 'Вырубки для торта'],
                ['link' => 'Диспенсеры, просеиватели, сита'],
                ['link' => 'Для декора и оформления'],
                ['link' => 'Для изготовления цветов и листьев'],
            ]
        ],
    ]
]
?>

<div class="wrapper">
    <?= $mustache->render('sort', $sort); ?>
    <?= $mustache->render('questions', $questions); ?>
    <?= $mustache->render('collapsing', $collapsing); ?>
    <?= $mustache->render('menu', $menu); ?>
    <?= $mustache->render('confectionery', $confectionery); ?>
</div>



<?php
require_once($_SERVER['DOCUMENT_ROOT'] . '/include/footer.php');
